Revit 2026 API

# StructuralSectionGeneralISlopedFlangeAngle Property

---

Sloped flange angle. (rad)

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double SlopedFlangeAngle { get; set; }
```
```vb
Public Property SlopedFlangeAngle As Double
	Get
	Set
```
```cpp
public:
property double SlopedFlangeAngle {
	double get ();
	void set (double value);
}
```
```fsharp
member SlopedFlangeAngle : float with get, set
```

#### Property Value

Double

#### Reference

StructuralSectionGeneralI Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace